Revit 2027 API
JunctionType Enumeration
An enumerated type listing all the junction types for MEP curve types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum JunctionType
Public Enumeration JunctionType
public enum class JunctionType
type JunctionType
Members
Member name | Value | Description
Tap | 0 | The junction type is tap.
Tee | 1 | The junction type is tee.
See Also
Reference
Autodesk.Revit.DB Namespace